examples/hot-point-drill-onePhase/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1.0;

R       0.01; //radius of the drill
L       0.025; //length of the drill
delta   0.0005; //initial channel thickness
alpha   1; //half opening angle of the wedge in degrees

// mesh parameters //
dx      0.0002; //width of first cell
Ny      12; //number of cells in cross-channel direction


tanalpha #calc "tan(degToRad($alpha))";

vertices
(
    (0 #neg $delta 0)
    (#calc "$R + $delta" $R #calc "-1. * ($R + $delta) * $tanalpha")
    (#calc "$R + $delta" $L #calc "-1. * ($R + $delta) * $tanalpha")
    ($R $L #calc "-1. * $R * $tanalpha")
    ($R $R #calc "-1. * $R * $tanalpha")
    (0 0 0)

    (#calc "$R + $delta" $R #calc "($R + $delta) * $tanalpha")
    (#calc "$R + $delta" $L #calc "($R + $delta) * $tanalpha")
    ($R $L #calc "$R * $tanalpha")
    ($R $R #calc "$R * $tanalpha")
);

blocks
(
    hex (0 1 4 5 0 6 9 5) (#calc "round(0.5 * $R * M_PI / $dx)" $Ny 1) simpleGrading (1 1 1)
    hex (1 2 3 4 6 7 8 9) (#calc "round(($L - $R) / $dx)" $Ny 1) simpleGrading (1 1 1)
);



edges
(
 arc 0 1
 (
        #calc "sqrt(0.5) * ($R + $delta)"
        #calc "$R - 1. * sqrt(0.5) * ($R + $delta)"
        #calc "-1. * $tanalpha * sqrt(0.5) * ($R + $delta)"
 )
 arc 0 6
 (
        #calc "sqrt(0.5) * ($R + $delta)"
        #calc "$R - 1. * sqrt(0.5) * ($R + $delta)"
        #calc "$tanalpha * sqrt(0.5) * ($R + $delta)"
 )
 arc 5 4
 (
        #calc "sqrt(0.5) * $R"
        #calc "$R - 1. * sqrt(0.5) * $R"
        #calc "-1. * $tanalpha * sqrt(0.5) * $R"
 )
 arc 5 9
 (
        #calc "sqrt(0.5) * $R"
        #calc "$R - 1. * sqrt(0.5) * $R"
        #calc "$tanalpha * sqrt(0.5) * $R"
 )
);

boundary
(
    symmetryAxis
    {
        type empty;
        faces
        (
            (0 5 5 0)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (2 3 8 7)
        );
    }
    head
    {
        type wall;
        faces
        (
            (5 4 9 5)
        );
    }
    shaft
    {
        type wall;
        faces
        (
            (3 4 9 8)
        );
    }
    ice
    {
        type wall;
        faces
        (
            (0 1 6 0)
            (1 2 7 6)
        );
    }
    back
    {
        type wedge;
        faces
        (
            (0 1 4 5)
            (1 2 3 4)
        );
    }
    front
    {
        type wedge;
        faces
        (
            (0 6 9 5)
            (6 7 8 9)
        );
    }
);

// ************************************************************************* //
